app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
	  @articles = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@article = Article.find(params[:id])

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Article"], ["body", "This one has a body"], ["created_at", "2019-08-22 13:23:00.092386"], ["updated_at", "2019-08-22 13:23:00.092386"]]
---
	def create
		@article = Article.new(article_params)
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 9]]
---
	def destroy
		@article = Article.find(params[:id])
		@article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
	def edit
		@article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Hi, I am Rafael Garcia. Welcome to my blog"], ["updated_at", "2019-08-22 20:42:38.403386"], ["id", 2]]
---
	def update
  		@article = Article.find(params[:id])
  		@article.update(article_params)