app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "Rafagars"], ["body", "Hi guys!"], ["article_id", 2], ["created_at", "2019-08-22 17:58:26.343807"], ["updated_at", "2019-08-22 17:58:26.343807"]]
---
	def create
  		@comment = Comment.new(comment_params)
  		@comment.article_id = params[:article_id]

  		@comment.save